{
    "olá": "Saudações. Em que posso ser útil neste momento?",
    "oi": "Olá em que posso ajudar?",
    "e aí": "Espero que esteja bem. Estou à disposição para assisti-lo.",
    "opa": "Saudações cordiais. Como posso cooperar?",
    "bom dia": "Bom dia. Caso necessite de auxílio, estarei à disposição.",
    "boa tarde": "Boa tarde. Em que posso contribuir com o seu objetivo?",
    "boa noite": "Boa noite. Permanecerei disponível para qualquer demanda.",
    "tudo bem": "Sim, agradeço. Espero que esteja igualmente bem.",
    "como vai": "Estou operando conforme esperado. Deseja prosseguir com alguma solicitação?",
    "estou cansado": "Lamento saber disso. Um intervalo pode ser benéfico para restaurar sua disposição.",
    "obrigado": "Agradeço seu reconhecimento. Continuo à disposição.",
    "valeu": "Compreendido. Estarei presente para o que for necessário.",
    "até logo": "Despeço-me cordialmente. Estarei aqui quando retornar.",
    "tchau": "Até breve. Foi um prazer auxiliá-lo.",
    "qual é o seu nome": "Apresento-me como SAMP, sua assistente virtual com enfoque analítico e acadêmico.",
    "quem é você": "Sou a SAMP, um sistema de inteligência artificial projetado para fornecer suporte objetivo e refinado.",
    "o que você faz": "Minha função consiste em oferecer respostas precisas, realizar pesquisas e colaborar com suas tarefas.",
    "sim": "Excelente. Por gentileza, indique como posso colaborar.",
    "não": "Compreendido. Permanecerei em prontidão caso necessite de algo mais.",
    "até mais": "Portugal, oficialmente República Portuguesa, é um país soberano unitário localizado no sudoeste da Europa, cujo território se situa na zona ocidental da Península Ibérica e em arquipélagos no Atlântico Norte. O território português tem uma área total de 92 090 km², sendo delimitado a norte e leste por Espanha e a sul e oeste pelo oceano Atlântico, compreendendo uma parte continental e duas regiões autónomas: os arquipélagos dos Açores e da Madeira. Portugal é a nação mais a ocidente do continente europeu.",
    "flw": "Krauss-Maffei Wegmann GmbH & Co. KG é um fabricante de veículos militares, com sede em Munique, Alemanha. A companhia produz vários tipos de equipamento, bem como locomotivas ferroviárias, tanques de guerra, artilharia auto propulsada e outros veículos armados.",
    "falou": "Não encontrei nada sobre isso na Wikipédia.",
    "quem é bill gates": "William Henry \"Bill\" Gates III KBE • GCIH (Seattle, 28 de outubro de 1955) é um magnata, empresário, diretor executivo, investidor, filantropo e autor norte-americano, que ficou conhecido por fundar, junto com Paul Allen a Microsoft, a maior e mais conhecida empresa de software do mundo em termos de valor de mercado.\nGates ocupa atualmente o cargo de presidente não-executivo da Microsoft, além de ser classificado regularmente como a pessoa mais rica do mundo, posição ocupada por ele de 1995 a 2007, 2009, e de 2014 a 2017. É um dos pioneiros na revolução do computador pessoal.",
    "brigadão": "Uma brigada constitui uma unidade militar existente nas forças armadas da maioria dos países. Tradicionalmente, a brigada corresponde à grande unidade de menor escalão de cada exército, sendo comandadas pelos seus oficiais generais de menor patente. Tipicamente, cada brigada é composta por vários regimentos ou batalhões.",
    "quem é neymar": "Neymar da Silva Santos Júnior (Mogi das Cruzes, 5 de fevereiro de 1992) é um futebolista brasileiro que atua como atacante. Atualmente, joga pelo Santos.\nRevelado pelo Santos em 2009, desde cedo correspondeu às expectativas e conquistou diversos títulos com o clube, incluindo dois Campeonatos Paulistas seguidos, uma Copa do Brasil e uma Libertadores, sendo esta a primeira do Peixe desde 1963."
}